<?php

return [
    0 => 'success',
    1000 => '数据已过期',
    1001 => '未绑定手机号',
    1002 => '不可重复兑换优惠券',
    1003 => '优惠券不存在或已经被使用',
    1004 => '修改失败，昵称或手机号已被使用',

    2000 => '不可作用于当前用户自身',
    2001 => '正在审核中',
    2002 => '已认证',
    2003 => '当前手机号已经绑定过微信或QQ',

    4000 => '请求出错，缺少必须的参数',
    4001 => '无效令牌，需要重新获取',
    4002 => '请求出错，参数无效或错误',
    4003 => '当前接口禁止访问',
    4005 => '请求出错，user_id与令牌不匹配',

    5000 => '系统错误，无法生成令牌',
    5001 => '当前客户端未授权，需要重新登录',
    5002 => '无法响应请求，服务端异常',
    5003 => 'API系统维护中',
    5004 => '暂无数据',
    5005 => '保存数据失败',
    5006 => '三方验签失败'
];